In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

In [2]:
import webbrowser
site = "https://az.wikipedia.org/wiki/D%C3%BCnya_%C9%99halisi"
webbrowser.open(site)

True

In [9]:
text = pd.read_clipboard()
text

,İl,Dünya,Asiya,Afrika,Avropa,Latın Amerikası,Şimali Amerika,Okeaniya
0,2000,"6,115","3,698 (60.5%)",819 (13.4%),727 (11.9%),521 (8.5%),319 (5.2%),31 (0.5%)
1,2005,"6,512","3,937 (60.5%)",921 (14.1%),729 (11.2%),557 (8.6%),335 (5.1%),34 (0.5%)
2,2010,"6,909","4,167 (60.3%)","1,033 (15.0%)",733 (10.6%),589 (8.5%),352 (5.1%),36 (0.5%)
3,2015,"7,302","4,391 (60.1%)","1,153 (15.8%)",734 (10.1%),618 (8.5%),368 (5.0%),38 (0.5%)
4,2020,"7,675","4,596 (59.9%)","1,276 (16.6%)",733 (9.6%),646 (8.4%),383 (5.0%),40 (0.5%)
5,2025,"8,012","4,773 (59.6%)","1,400 (17.5%)",729 (9.1%),670 (8.4%),398 (5.0%),43 (0.5%)
6,2030,"8,309","4,917 (59.2%)","1,524 (18.3%)",723 (8.7%),690 (8.3%),410 (4.9%),45 (0.5%)
7,2035,"8,571","5,032 (58.7%)","1,647 (19.2%)",716 (8.4%),706 (8.2%),421 (4.9%),46 (0.5%)
8,2040,"8,801","5,125 (58.2%)","1,770 (20.1%)",708 (8.0%),718 (8.2%),431 (4.9%),48 (0.5%)
9,2045,"8,996","5,193 (57.7%)","1,887 (21.0%)",700 (7.8%),726 (8.1%),440 (4.9%),50 (0.6%)
10,2050,"9,150","5,231 (57.2%)","1,998 (21.8%)",691 (7.6%),729 (8.0%),448 (4.9%),51 (0.6%)

In [11]:
text2 = pd.read_clipboard()
text2

,Region,1500,1600,1700,1750,1800,1850,1900,1950,1999,2008,2050,2150
0,Dünya,458,580,682,791,978,"1,262","1,650","2,521","5,978","6,707","8,909","9,746"
1,Afrika,86,114,106,106,107,111,133,221,767,973,"1,766","2,308"
2,Asiya,243,339,436,502,635,809,947,"1,402","3,634","4,054","5,268","5,561"
3,Avropa,84,111,125,163,203,276,408,547,729,732,628,517
4,Latın Amerikası və Karib hövzəsi,39,10,10,16,24,38,74,167,511,577,809,912
5,Şimali Amerika,3,3,2,2,7,26,82,172,307,337,392,398
6,Okeaniya,3,3,3,2,2,2,6,13,30,34,46,51

In [12]:
df = pd.DataFrame(randn(5,3))
df

          0         1         2
0 -0.122161  0.620397  0.594593
1  1.177937  0.166303 -0.684057
2 -1.370633 -1.138893  0.573563
3 -0.888164  2.397613 -0.125608
4 -0.764472  0.337687  0.238211

In [13]:
df.to_clipboard()
pd.read_clipboard()

          0         1         2
0 -0.122161  0.620397  0.594593
1  1.177937  0.166303 -0.684057
2 -1.370633 -1.138893  0.573563
3 -0.888164  2.397613 -0.125608
4 -0.764472  0.337687  0.238211

In [14]:
text2

,Region,1500,1600,1700,1750,1800,1850,1900,1950,1999,2008,2050,2150
0,Dünya,458,580,682,791,978,"1,262","1,650","2,521","5,978","6,707","8,909","9,746"
1,Afrika,86,114,106,106,107,111,133,221,767,973,"1,766","2,308"
2,Asiya,243,339,436,502,635,809,947,"1,402","3,634","4,054","5,268","5,561"
3,Avropa,84,111,125,163,203,276,408,547,729,732,628,517
4,Latın Amerikası və Karib hövzəsi,39,10,10,16,24,38,74,167,511,577,809,912
5,Şimali Amerika,3,3,2,2,7,26,82,172,307,337,392,398
6,Okeaniya,3,3,3,2,2,2,6,13,30,34,46,51

In [15]:
text2['Region']

0                               Dünya
1                              Afrika
2                               Asiya
3                              Avropa
4    Latın Amerikası və Karib hövzəsi
5                      Şimali Amerika
6                            Okeaniya
Name: Region, dtype: object

In [16]:
text2['1500']

0    458
1     86
2    243
3     84
4     39
5      3
6      3
Name: 1500, dtype: int64

In [17]:
text2.columns

Index(['Region', '1500', '1600', '1700', '1750', '1800', '1850', '1900',
       '1950', '1999', '2008', '2050', '2150'],
      dtype='object')

In [18]:
text3 = DataFrame(text2,columns=text2.columns[:4])
text3

                             Region  1500  1600  1700
0                             Dünya   458   580   682
1                            Afrika    86   114   106
2                             Asiya   243   339   436
3                            Avropa    84   111   125
4  Latın Amerikası və Karib hövzəsi    39    10    10
5                    Şimali Amerika     3     3     2
6                          Okeaniya     3     3     3

In [24]:
text3

                             Region  1500  1600  1700
0                             Dünya   458   580   682
1                            Afrika    86   114   106
2                             Asiya   243   339   436
3                            Avropa    84   111   125
4  Latın Amerikası və Karib hövzəsi    39    10    10
5                    Şimali Amerika     3     3     2
6                          Okeaniya     3     3     3

In [33]:
text3.head(2)

   Region  1500  1600  1700
0   Dünya   458   580   682
1  Afrika    86   114   106

In [35]:
text3.tail(2)

           Region  1500  1600  1700
5  Şimali Amerika     3     3     2
6        Okeaniya     3     3     3

In [43]:
text3.index

RangeIndex(start=0, stop=7, step=1)

In [46]:
text3.values

array([['Dünya', 458, 580, 682],
       ['Afrika', 86, 114, 106],
       ['Asiya', 243, 339, 436],
       ['Avropa', 84, 111, 125],
       ['Latın Amerikası və Karib hövzəsi', 39, 10, 10],
       ['Şimali Amerika', 3, 3, 2],
       ['Okeaniya', 3, 3, 3]], dtype=object)

In [50]:
text3.values[2]

array(['Asiya', 243, 339, 436], dtype=object)

### Describe məlumatlarınızın tez bir zaman ərzində statistik xülasəsini göstərər

In [51]:
text3

                             Region  1500  1600  1700
0                             Dünya   458   580   682
1                            Afrika    86   114   106
2                             Asiya   243   339   436
3                            Avropa    84   111   125
4  Latın Amerikası və Karib hövzəsi    39    10    10
5                    Şimali Amerika     3     3     2
6                          Okeaniya     3     3     3

In [52]:
text3.describe()

             1500        1600        1700
count    7.000000    7.000000    7.000000
mean   130.857143  165.714286  194.857143
std    165.800511  217.764180  263.441599
min      3.000000    3.000000    2.000000
25%     21.000000    6.500000    6.500000
50%     84.000000  111.000000  106.000000
75%    164.500000  226.500000  280.500000
max    458.000000  580.000000  682.000000